#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Prod Plan 📖`success`
#### Preview URL 🌎 [https://](https://)
<details><summary>Show Prod Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sql.azurerm_key_vault.vault will be created
  + resource "azurerm_key_vault" "vault" {
      + access_policy                 = [
          + {
              + key_permissions     = [
                  + "Get",
                  + "List",
                  + "Create",
                  + "Rotate",
                  + "GetRotationPolicy",
                  + "SetRotationPolicy",
                  + "Delete",
                  + "Recover",
                ]
              + object_id           = "7bdd0ef2-6c8c-4483-b155-b7e1401110f8"
              + secret_permissions  = [
                  + "Get",
                  + "Set",
                  + "List",
                ]
              + storage_permissions = [
                  + "Get",
                  + "Set",
                ]
              + tenant_id           = "567e2175-bf4e-4bcc-b114-335fa0061f2f"
            },
          + {
              + key_permissions     = [
                  + "Get",
                  + "WrapKey",
                  + "UnwrapKey",
                ]
              + object_id           = (known after apply)
              + secret_permissions  = [
                  + "Get",
                  + "Set",
                  + "List",
                ]
              + storage_permissions = [
                  + "Get",
                  + "Set",
                ]
              + tenant_id           = (known after apply)
            },
          + {
              + key_permissions     = [
                  + "Get",
                  + "WrapKey",
                  + "UnwrapKey",
                ]
              + object_id           = "7dfd636f-dfc0-40d9-aabc-9c38f63c0628"
              + secret_permissions  = [
                  + "Get",
                  + "Set",
                  + "List",
                ]
              + storage_permissions = [
                  + "Get",
                  + "Set",
                ]
              + tenant_id           = "567e2175-bf4e-4bcc-b114-335fa0061f2f"
            },
        ]
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "kv-sql-prod-eus"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "rg-sql-prod-eus"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "567e2175-bf4e-4bcc-b114-335fa0061f2f"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.sql.azurerm_key_vault_key.sql will be created
  + resource "azurerm_key_vault_key" "sql" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "unwrapKey",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "key-sql-prod-eus"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.sql.azurerm_key_vault_secret.sql-secret will be created
  + resource "azurerm_key_vault_secret" "sql-secret" {
      + expiration_date         = "2025-07-31T00:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sql.azurerm_monitor_diagnostic_setting.logs will be created
  + resource "azurerm_monitor_diagnostic_setting" "logs" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + name                           = "ds-sql-prod-eus"
      + storage_account_id             = (known after apply)
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"

          + retention_policy {
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.sql.azurerm_mssql_database.database[0] will be created
  + resource "azurerm_mssql_database" "database" {
      + auto_pause_delay_in_minutes         = (known after apply)
      + collation                           = (known after apply)
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = (known after apply)
      + min_capacity                        = (known after apply)
      + name                                = "test"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = (known after apply)
      + storage_account_type                = "Geo"
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = (known after apply)

      + long_term_retention_policy {
          + monthly_retention = "P1M"
          + week_of_year      = (known after apply)
          + weekly_retention  = (known after apply)
          + yearly_retention  = (known after apply)
        }
    }

  # module.sql.azurerm_mssql_database.database[1] will be created
  + resource "azurerm_mssql_database" "database" {
      + auto_pause_delay_in_minutes         = (known after apply)
      + collation                           = (known after apply)
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = (known after apply)
      + min_capacity                        = (known after apply)
      + name                                = "test2"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = (known after apply)
      + storage_account_type                = "Geo"
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = (known after apply)

      + long_term_retention_policy {
          + monthly_retention = "P1M"
          + week_of_year      = (known after apply)
          + weekly_retention  = (known after apply)
          + yearly_retention  = (known after apply)
        }
    }

  # module.sql.azurerm_mssql_database.database[2] will be created
  + resource "azurerm_mssql_database" "database" {
      + auto_pause_delay_in_minutes         = (known after apply)
      + collation                           = (known after apply)
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = (known after apply)
      + min_capacity                        = (known after apply)
      + name                                = "test3"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = (known after apply)
      + storage_account_type                = "Geo"
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = (known after apply)

      + long_term_retention_policy {
          + monthly_retention = "P1M"
          + week_of_year      = (known after apply)
          + weekly_retention  = (known after apply)
          + yearly_retention  = (known after apply)
        }
    }

  # module.sql.azurerm_mssql_server.sql will be created
  + resource "azurerm_mssql_server" "sql" {
      + administrator_login                          = "OSTAdmin"
      + administrator_login_password                 = (sensitive value)
      + connection_policy                            = "Default"
      + fully_qualified_domain_name                  = (known after apply)
      + id                                           = (known after apply)
      + location                                     = "eastus"
      + minimum_tls_version                          = "1.2"
      + name                                         = "sql-sql-prod-eus"
      + outbound_network_restriction_enabled         = false
      + primary_user_assigned_identity_id            = (known after apply)
      + public_network_access_enabled                = false
      + resource_group_name                          = "rg-sql-prod-eus"
      + restorable_dropped_database_ids              = (known after apply)
      + transparent_data_encryption_key_vault_key_id = (known after apply)
      + version                                      = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = false
          + login_username              = "tim.moran@ostusa.com"
          + object_id                   = "7bdd0ef2-6c8c-4483-b155-b7e1401110f8"
          + tenant_id                   = "567e2175-bf4e-4bcc-b114-335fa0061f2f"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # module.sql.azurerm_mssql_server_transparent_data_encryption.sql will be created
  + resource "azurerm_mssql_server_transparent_data_encryption" "sql" {
      + auto_rotation_enabled = false
      + id                    = (known after apply)
      + key_vault_key_id      = (known after apply)
      + server_id             = (known after apply)
    }

  # module.sql.azurerm_network_security_group.sql-nsg will be created
  + resource "azurerm_network_security_group" "sql-nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-sql-prod-eus"
      + resource_group_name = "rg-sql-prod-eus"
      + security_rule       = (known after apply)
      + tags                = {
          + "created-by"      = "terraform"
          + "environment"     = "prod"
          + "purpose"         = "MS SQL Server for sql."
          + "repository-link" = "https://github.com/christianmscottost/azure-sql-tf"
          + "service"         = "sql"
        }
    }

  # module.sql.azurerm_private_endpoint.link will be created
  + resource "azurerm_private_endpoint" "link" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-sql-prod-eus"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = (known after apply)
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.sql.azurerm_private_endpoint.sql_link will be created
  + resource "azurerm_private_endpoint" "sql_link" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-sql-prod-eus"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = (known after apply)
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sqlServer",
            ]
        }
    }

  # module.sql.azurerm_private_endpoint.storage_link will be created
  + resource "azurerm_private_endpoint" "storage_link" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-sql-prod-eus"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = (known after apply)
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "File",
            ]
        }
    }

  # module.sql.azurerm_resource_group.sql will be created
  + resource "azurerm_resource_group" "sql" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-sql-prod-eus"
      + tags     = {
          + "created-by"      = "terraform"
          + "environment"     = "prod"
          + "purpose"         = "MS SQL Server for sql."
          + "repository-link" = "https://github.com/christianmscottost/azure-sql-tf"
          + "service"         = "sql"
        }
    }

  # module.sql.azurerm_storage_account.logs will be created
  + resource "azurerm_storage_account" "logs" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "GRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = true
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = "sasqlprodeus"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg-sql-prod-eus"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + customer_managed_key {
          + key_vault_key_id          = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.sql.azurerm_storage_encryption_scope.encrypt will be created
  + resource "azurerm_storage_encryption_scope" "encrypt" {
      + id                                 = (known after apply)
      + infrastructure_encryption_required = true
      + key_vault_key_id                   = (known after apply)
      + name                               = "scopesqlprodeus"
      + source                             = "Microsoft.Storage"
      + storage_account_id                 = (known after apply)
    }

  # module.sql.azurerm_subnet.link will be created
  + resource "azurerm_subnet" "link" {
      + address_prefixes                               = [
          + "10.0.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-sql-prod-eus"
      + service_endpoints                              = [
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = (known after apply)
    }

  # module.sql.azurerm_subnet_network_security_group_association.sql-nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "sql-nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.sql.azurerm_user_assigned_identity.sql_id will be created
  + resource "azurerm_user_assigned_identity" "sql_id" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "sql-admin-sql-prod-eus"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-sql-prod-eus"
      + tenant_id           = (known after apply)
    }

  # module.sql.azurerm_virtual_network.link will be created
  + resource "azurerm_virtual_network" "link" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = "rg-sql-prod-eus"
      + subnet              = (known after apply)
    }

  # module.sql.random_password.sql-password will be created
  + resource "random_password" "sql-password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&,."
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.sql.random_password.sql-password-2 will be created
  + resource "random_password" "sql-password-2" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&,."
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.sql.random_string.link will be created
  + resource "random_string" "link" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 23 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
Pushed by: @tmoran-ost, Action: pull_request